<img src="images\Logo_UCLL_ENG_RGB.png" style="background-color:white;" />

# Data Analytics & Machine learning

Lecturers: Aim√©e Lynn Backiel, Chidi Nweke, Daan Nijs

Academic year 2023-2024

## Lab 2: Introduction to the case and Pandas

### Lecture outline

1. Recap last week
2. Introduction to the case
3. Data exploration using Pandas
   1. Univariate analysis
   2. Bivariate analysis

### Recap of last lecture(s)

#### Week 1

1. We ensured we had a valid Python installation.
2. We learnt what a virtual environment is:
   * Isolated Python executable and packages.
   * We created a virtual environment.
3. Absolute path vs relative path recap.
4. Recap of data structures in Python

### The case

Ada Turing Travelogue, or as everyone calls her, Ada just started working part time at her parents travel agency. She has a keen understanding and interest of everything related to applied computer science ranging from server & system management to full stack software development. Through database foundations she already understands how to query data and programming 1 and 2 covered the essentials about the Python programming language. Recently she has just decided to start learning about data analytics & machine learning as well.

She uses her skills to connect to the travel agency's database where she finds many, normalized, tables. Ada recalls what she learnt in database foundations and performs all the correct joins. Afterwards she saves the data in the `data/` folder.


She finds the following dataset:

| Column Name          | Description                                                                                       |
| -------------------- | ------------------------------------------------------------------------------------------------- |
| SalesID              | Unique identifier for each sale.                                                                  |
| Age                  | Age of the traveler.                                                                              |
| Country              | Country of origin of the traveler.                                                                |
| Membership_Status    | Membership level of the traveler in the booking system; could be 'standard', 'silver', or 'gold'. |
| Previous_Purchases   | Number of previous bookings made by the traveler.                                                 |
| Destination          | Travel destination chosen by the traveler.                                                        |
| Stay_length          | Duration of stay at the destination.                                                              |
| Guests               | Number of guests traveling (including the primary traveler).                                             |
| Travel_month         | Month in which the travel is scheduled.                                                           |
| Months_before_travel | Number of months prior to travel that the booking was made.                                       |
| Earlybird_discount   | Boolean flag indicating whether the traveler received an early bird discount.                     |
| Package_Type         | Type of travel package chosen by the traveler.                                                    |
| Cost                 | Calculated cost of the travel package.                                                            |
| Margin | The cost (for the traveler) - what the travel agency pays. |
 | Additional_Services_Cost| The amount of additional services (towels, car rentals, room service, ...) that was bought during the trip. |

### Helping Ada explore the dataset

The main goal for the remainder of this lab is to explore the data. We will specifically take four columns:

* Cost
* age
* stay length
* Destination

Our goal is to find interesting relationships between them.

As was covered in the book and lecture there are to main data types in analytics: categorical and continuous data. This is a crucial first step in your analysis because it determines what methods make sense on your data.

**The goal is primarily to find out what influences the cost of the stay.**

### Introduction to Pandas

<center><img src="images\pandas_logo.png"  style="background-color:white;"></center>

Pandas stands for panel data, a type of dataset used in economics. Although this was the reason Pandas was invented, it is widely used in across analytics and one of Python's many "killer apps". Essentially, it's a package that makes Python unique compared to some of its competitors.

#### Installing Pandas


Before we start it is a good idea to check if you have pandas installed yet. You can do that with the following command in a notebook cell `!pip list`. Notice the exclamation mark (!), it allows you to run things in a code cell as it were a terminal. You can also open the terminal itself and write `pip list`.

In [1]:
!pip list

Package                       Version
----------------------------- --------
accessible-pygments           0.0.4
alabaster                     0.7.13
asttokens                     2.2.1
attrs                         23.1.0
Babel                         2.12.1
backcall                      0.2.0
beautifulsoup4                4.12.2
black                         23.9.1
certifi                       2023.5.7
charset-normalizer            3.1.0
click                         8.1.3
colorama                      0.4.6
comm                          0.1.3
debugpy                       1.6.7
decorator                     5.1.1
docutils                      0.18.1
executing                     1.2.0
fastjsonschema                2.17.1
flake8                        6.1.0
greenlet                      2.0.2
idna                          3.4
imagesize                     1.4.1
importlib-metadata            6.6.0
ipykernel                     6.23.1
ipython                       8.14.0
jedi                          0.18.2
Jinja2                        3.1.2
joblib                        1.3.2
jsonschema                    4.17.3
jupyter-book                  0.15.1
jupyter-cache                 0.6.1
jupyter_client                8.2.0
jupyter_core                  5.3.0
jupytercards                  2.5.5
JupyterQuiz                   2.6.2
latexcodec                    2.0.1
linkify-it-py                 2.0.2
markdown-it-py                2.2.0
MarkupSafe                    2.1.3
matplotlib-inline             0.1.6
mccabe                        0.7.0
mdit-py-plugins               0.3.5
mdurl                         0.1.2
mypy-extensions               1.0.0
myst-nb                       0.17.2
myst-parser                   0.18.1
nbclient                      0.7.4
nbformat                      5.9.0
nest-asyncio                  1.5.6
numpy                         1.24.3
packaging                     23.1
pandas                        2.0.2
parso                         0.8.3
pathspec                      0.11.2
pickleshare                   0.7.5
pip                           23.1.2
platformdirs                  3.5.1
prompt-toolkit                3.0.38
psutil                        5.9.5
pure-eval                     0.2.2
pybtex                        0.24.0
pybtex-docutils               1.0.2
pycodestyle                   2.11.0
pydata-sphinx-theme           0.13.3
pyflakes                      3.1.0
Pygments                      2.15.1
pyrsistent                    0.19.3
python-dateutil               2.8.2
pytz                          2023.3
pywin32                       306
PyYAML                        6.0
pyzmq                         25.1.0
requests                      2.31.0
scikit-learn                  1.3.0
scipy                         1.9.3
setuptools                    67.8.0
six                           1.16.0
snowballstemmer               2.2.0
soupsieve                     2.4.1
Sphinx                        5.0.2
sphinx-book-theme             1.0.1
sphinx-comments               0.0.3
sphinx-copybutton             0.5.2
sphinx_design                 0.3.0
sphinx_external_toc           0.3.1
sphinx-jupyterbook-latex      0.5.2
sphinx-multitoc-numbering     0.1.3
sphinx-thebe                  0.2.1
sphinx-togglebutton           0.3.2
sphinxcontrib-applehelp       1.0.4
sphinxcontrib-bibtex          2.5.0
sphinxcontrib-devhelp         1.0.2
sphinxcontrib-htmlhelp        2.0.1
sphinxcontrib-jsmath          1.0.1
sphinxcontrib-qthelp          1.0.3
sphinxcontrib-serializinghtml 1.1.5
SQLAlchemy                    2.0.15
stack-data                    0.6.2
tabulate                      0.9.0
threadpoolctl                 3.2.0
tornado                       6.3.2
traitlets                     5.9.0
typing_extensions             4.6.3
tzdata                        2023.3
uc-micro-py                   1.0.2
urllib3                       2.0.2
wcwidth                       0.2.6
wheel                         0.40.0
zipp                          3.15.0

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip


`pip list` shows you the full set of packages you have installed. If you are making this lab from Google colab Pandas will already be installed. You can double check this with `!pip list | grep pandas`. `|` is the pipe operator which gives the result of the preceding statement to `grep` which searches the text for Pandas. You can run this on unix-based operating systems as well. If you are on Windows you can run the command: `!pip list | findstr pandas`.

In [2]:
!pip list | findstr pandas

pandas                        2.0.2

[notice] A new release of pip is available: 23.1.2 -> 23.2.1
[notice] To update, run: python.exe -m pip install --upgrade pip


**‚ùó If you have a long list of packages and you are not working from google Colab that is likely an indication you're not working from a virtual environment. Follow the instructions that were listed in the beginning of the class, ask us or send us an e-mail.**

If you're working locally and have followed the instructions Pandas will not be installed yet. You can do so by running `pip install pandas` in the terminal or in a code cell (including the exclamation mark).

In [3]:
# Uncomment to install Pandas

#!pip install pandas

#### Reading and exploring data

It's important to know that Pandas is a massive library with a lot of features. For the scope of this course you won't need a lot of it. We recommend you to look at the <a href=./Pandas_Cheat_Sheet.pdf>the cheat sheet</a> to discover what functionality Pandas has. We also recommend you to read the documentation of some of the functions we are using.

Pandas is typically imported as pd by convention. The package makes it incredibly easy to read and write data from different file formats. On top of that it comes with many operations that make working with data easy.

In [4]:
import pandas as pd # by convention

###### üíªüìäüí°<a href="https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html"> `pd.read_csv` is used to read data from a filepath.</a>

In [5]:
travel_dataset = pd.read_csv("data/lab_2_dataset.csv")

##### ‚ùì To be sure: did we use a relative or an absolute path?

We used an relative path. It is not prefixed by a `/`. If you can't find the file make sure you're in the right directory by using `os.getcwd()` and `os.listdir()`.

One of the first things you typically do with a dataset is print out the first few rows.

##### üíªüìäüí° <a href=https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.head.html>dataframe.head() prints out the first few lines of the dataframe.</a>

In [6]:
travel_dataset.head()

,sales_id,age,country,membership_status,previous_purchases,destination,stay_length,guests,travel_month,months_before_travel,earlybird_discount,package_Type,cost,rating,margin,additional_services_cost
0,1,47,UK,silver,1,Sydney,4,2,7,1,False,Adventure,1706.093478,6,1219.740722,291.061043
1,2,37,Italy,silver,5,Tokyo,4,2,8,4,False,Adventure,1779.956899,7,1570.387236,405.516446
2,3,49,USA,standard,2,Sydney,3,4,7,1,False,Cultural,2829.920469,6,2360.488698,285.364191
3,4,62,Spain,silver,2,Cape Town,7,2,1,3,True,Adventure,2789.528342,7,2315.659102,747.533464
4,5,36,Germany,silver,3,Paris,9,3,2,7,False,Adventure,5357.997309,5,5042.139271,1117.092552

Accessing the columns is equally trivial.

In [7]:
travel_dataset.columns

Index(['sales_id', 'age', 'country', 'membership_status', 'previous_purchases',
       'destination', 'stay_length', 'guests', 'travel_month',
       'months_before_travel', 'earlybird_discount', 'package_Type', 'cost',
       'rating', 'margin', 'additional_services_cost'],
      dtype='object')

Before we proceed we will take a subset of our dataset cost, age, stay length and destination. Doing so is similar to working with dictionaries.

In [8]:
travel_dataset["country"]

0              UK
1           Italy
2             USA
3           Spain
4         Germany
          ...
9995      Germany
9996    Australia
9997          USA
9998          USA
9999       Canada
Name: country, Length: 10000, dtype: object

In [9]:
travel_dataset["age"]

0       47
1       37
2       49
3       62
4       36
        ..
9995    59
9996    18
9997    29
9998    47
9999    49
Name: age, Length: 10000, dtype: int64

In [10]:
travel_dataset["stay_length"]

0        4
1        4
2        3
3        7
4        9
        ..
9995    11
9996     6
9997     5
9998    16
9999    15
Name: stay_length, Length: 10000, dtype: int64

To get multiple columns at once we need to pass in a list of columns

In [11]:
columns = ["country", "stay_length", "age", "cost"]
travel_dataset_subset = travel_dataset[columns]
travel_dataset_subset

        country  stay_length  age          cost
0            UK            4   47   1706.093478
1         Italy            4   37   1779.956899
2           USA            3   49   2829.920469
3         Spain            7   62   2789.528342
4       Germany            9   36   5357.997309
...         ...          ...  ...           ...
9995    Germany           11   59   7504.776391
9996  Australia            6   18   1427.122722
9997        USA            5   29   3458.860603
9998        USA           16   47  18392.267180
9999     Canada           15   49   3041.913051

[10000 rows x 4 columns]

#### Intermezzo: Series and Dataframes are mutable

The first important thing to notice about Pandas dataframe is that they are a combination of Pandas Series (columns).

<center><img src="images\df_vs_series.png"  style="background-color:white;"></center>

**‚ùó Pandas Series and Dataframes are mutable. This can be a big source of frustration and unexpected behavior.**

In [12]:
# The easiest way to make a dataframe is start from a list of dictionaries

students = [{"name": "Omar", "age": 21}, {"name": "Alisha", "age":19}, {"name": "Joost", "age":18}]
students_df = pd.DataFrame(students)
students_df

     name  age
0    Omar   21
1  Alisha   19
2   Joost   18

In [13]:
type(students_df)

pandas.core.frame.DataFrame

In [14]:
students_df["name"]

0      Omar
1    Alisha
2     Joost
Name: name, dtype: object

In [15]:
type(students_df["name"])

pandas.core.series.Series

In [16]:
student_names = students_df["name"]
student_names

0      Omar
1    Alisha
2     Joost
Name: name, dtype: object

In [17]:
# Pandas complains about you doing this.
student_names[1] = "Katrien"
student_names

C:\Users\u0140497\AppData\Local\Temp\ipykernel_22612\3863970960.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_names[1] = "Katrien"

0       Omar
1    Katrien
2      Joost
Name: name, dtype: object

In [18]:
students_df

      name  age
0     Omar   21
1  Katrien   19
2    Joost   18

In [19]:
# If you want to try something out an want to "keep" your original data
students_copy = students_df.copy()
student_names = students_copy["name"]
student_names[1] = "Alisha"
students_copy

C:\Users\u0140497\AppData\Local\Temp\ipykernel_22612\3019043404.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  student_names[1] = "Alisha"

     name  age
0    Omar   21
1  Alisha   19
2   Joost   18

In [20]:
students_df

      name  age
0     Omar   21
1  Katrien   19
2    Joost   18

As you can see Pandas is warning us of this behavior with *"A value is trying to be set on a copy of a slice from a DataFrame"*. The documentation and error message aren't particularly helpful for beginners but the small example above demonstrates what they mean and why it's a problem.

#### Data exploration: univariate

After that short detour we now know that changing our subset `travel_dataset_subset` means we also change our original dataset. We will continue the exploration of our country, stay_length, age and cost variables.

1. We will start with a univariate analysis, which means we will explore one (uni) variable (variate) at a time. 
2. Later on we will move to two (bi) variables (variate) analyses 
3. We round it up with methods that are able to do multivariate analysis.

Recall that 

1. **Categorical variables** represent categories or labels (e.g., colors, genders). 
2. **Numeric variables** represent quantities and can be ordered or measured (e.g., age, height). 
3. There is a special case called **Ordinal variables**, these are categories where there is a meaningful order (e.g., clothes sizes: small, medium and large).

##### ‚ùì Which variables are categorical and which are numeric?

* Country is categorical.
* Stay length is numeric.
* age is numeric.
* Cost is numeric.

##### ‚ùì Do you recall how we can "summarize" or describe numeric variables?

* We can look at the mean, median and standard deviation
* min and max
* Quintiles
* ....

##### ‚ùì Carry this analysis out on the numeric variable(s).

üíªüìäüí° TIP: the names of the functions are intuitive. For instance `dataframe[column].min()` gets the minimum of that column. It is equivalent to `select min(column) from dataframe` in SQL. Knowing SQL makes it easy to translate back and forth.

üíªüìäüí° TIP: become good friends with the <a href=./Pandas_Cheat_Sheet.pdf>the cheat sheet</a> and the documentation

###### Age

In [21]:
travel_dataset["age"].mean()

39.9759

In [22]:
travel_dataset["age"].min()

18

In [23]:
travel_dataset["age"].max()

80

In [24]:
travel_dataset["age"].median()

39.0

In [25]:
travel_dataset["age"].std()

14.001640039023222

###### Cost

In [26]:
travel_dataset["cost"].mean()

5750.918555719313

In [27]:
travel_dataset["cost"].min()

94.28546256451816

In [28]:
travel_dataset["cost"].max()

56969.4981382295

In [29]:
travel_dataset["cost"].median()

4227.457434626165

In [30]:
travel_dataset["cost"].std()

5035.339341135813

###### stay length

In [31]:
travel_dataset["stay_length"].mean()

10.4914

In [32]:
travel_dataset["stay_length"].min()

1

In [33]:
travel_dataset["stay_length"].max()

68

In [34]:
travel_dataset["stay_length"].median()

9.0

In [35]:
travel_dataset["stay_length"].std()

7.053516941932231

##### ‚ùì Doing this one by one gets quite tedious. Is there any other way listed on the cheat sheet to do this for all variables at once?

In [36]:
# Good
travel_dataset[["age","stay_length", "cost"]].min()

age            18.000000
stay_length     1.000000
cost           94.285463
dtype: float64

In [37]:
import numpy as np

In [38]:
# Better
# Notice how we are passing a list of functions in aggregate
travel_dataset[["age","stay_length", "cost"]].aggregate([np.mean, np.max, np.median, np.min])

            age  stay_length          cost
mean    39.9759      10.4914   5750.918556
amax    80.0000      68.0000  56969.498138
median  39.0000       9.0000   4227.457435
amin    18.0000       1.0000     94.285463

In [39]:
# Best

travel_dataset[["age","stay_length", "cost"]].describe()

               age   stay_length          cost
count  10000.00000  10000.000000  10000.000000
mean      39.97590     10.491400   5750.918556
std       14.00164      7.053517   5035.339341
min       18.00000      1.000000     94.285463
25%       29.00000      5.000000   2293.912845
50%       39.00000      9.000000   4227.457435
75%       50.00000     14.000000   7561.063091
max       80.00000     68.000000  56969.498138

##### ‚ùì Carry this analysis out on the categorical variable(s).

üíªüìäüí° TIP: `dataframe[column].value_counts()` is a very powerful method. It is equivalent to `select column, count(column) from dataframe group by column`. If you forget `value_counts()` exists you can get there using your SQL knowledge. `dataframe.groupby("column").count()` also gets you very close.

In [40]:
travel_dataset["destination"].value_counts()

destination
Rio          1293
Sydney       1275
Cairo        1271
Paris        1259
Tokyo        1252
New York     1229
Cape Town    1224
Rome         1197
Name: count, dtype: int64

In [41]:
travel_dataset["destination"].mode()

0    Rio
Name: destination, dtype: object

#### Data exploration: bivariate

We will always also look at the combinations of variables and see if those have interesting insights.

##### ‚ùì What pairs of variables do you think are interesting to look at?

Destination and Age

stay length and destination

Age and cost

cost and stay length

##### ‚ùì What methods can you use to do this?

Categorical + continuous

* Group by aggregation function

Categorical + Categorical

* Frequency table

Continuous + continuous 

* Correlation

##### ‚ùì Carry out these analyses

üíªüìäüí° TIP: Things like  `dataframe[["column1", "column2"]].groupby("column1").mean()` are valid Pandas. In SQL this would be `select column1, mean(column2) from dataframe group by column 1`

In [42]:
travel_dataset[["age", "cost", "stay_length"]].corr()

                  age      cost  stay_length
age          1.000000  0.016005     0.001364
cost         0.016005  1.000000     0.752304
stay_length  0.001364  0.752304     1.000000

In [43]:
travel_dataset[["cost", "destination", "age", "stay_length"]].groupby("destination").mean()

                    cost        age  stay_length
destination
Cairo        5895.009655  39.873328    10.619197
Cape Town    5563.443851  40.129902    10.519608
New York     6025.465088  39.782750    10.732303
Paris        6043.698690  39.824464    10.852264
Rio          5334.818420  39.658159     9.936582
Rome         5787.009506  39.567251    10.370092
Sydney       5269.222825  40.051765     9.951373
Tokyo        6109.768426  40.912939    10.973642

That rounds up today's session. In the next session we will cover plotting in Python using Matplotlib and Seaborn. Right now all of your data analysis has been tables but plots are a lot more ergonomic to present your results in.